# Ex - GroupBy

### Introduction:

GroupBy can be summarizes as Split-Apply-Combine.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [3]:
drinks = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv")

In [4]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 4. Which continent drinks more beer on average?

In [5]:
drinks['beer_servings'].mean()

106.16062176165804

In [7]:
beer_continents = drinks.groupby('continent')['beer_servings'].mean()

In [8]:
beer_continents.head()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [9]:
beer_continents[beer_continents.values>drinks['beer_servings'].mean()]

continent
EU    193.777778
SA    175.083333
Name: beer_servings, dtype: float64

### Step 5. For each continent print the statistics for wine consumption.

In [13]:
drinks.groupby('continent')['wine_servings'].agg(['mean', 'std', 'min', 'max'])

                 mean        std  min  max
continent
AF          16.264151  38.846419    0  233
AS           9.068182  21.667034    0  123
EU         142.222222  97.421738    0  370
OC          35.625000  64.555790    0  212
SA          62.416667  88.620189    1  221

### Step 6. Print the mean alcoohol consumption per continent

In [14]:
drinks.groupby('continent')['total_litres_of_pure_alcohol'].mean()

continent
AF    3.007547
AS    2.170455
EU    8.617778
OC    3.381250
SA    6.308333
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [16]:
drinks.groupby('continent')['spirit_servings'].agg(['mean', 'min', 'max'])

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302